
-- Category 테이블에 데이터 삽입
INSERT INTO Category (category_name)
VALUES ('상의'),
       ('바지'),
       ('아우터');

-- SubCategory 테이블에 데이터 삽입
INSERT INTO SubCategory (category_id, sub_category_name)
VALUES (1, '맨투맨/스웨트'),
       (1, '셔츠/블라우스'),
       (1, '후드 티셔츠'),
       (1, '니트/스웨터'),
       (1, '티셔츠'),
       (2, '데님 팬츠'),
       (2, '코튼 팬츠'),
       (2, '슈프 팬츠/슬랙스'),
       (2, '트레이닝/조거 팬츠'),
       (3, '후드 집업'),
       (3, '블루종/MA-1'),
       (3, '레더/라이더 재킷'),
       (3, '슈트/블레이저 재킷');

-- Product 데이터 삽입
INSERT INTO Product (product_code, product_name, cost, sub_category_id, created_at)
VALUES ('P001', '무지 맨투맨', 25000, 1, NOW()),
       ('P002', '무지 스웨트셔츠', 27000, 1, NOW()),
       ('P003', '무지 셔츠', 30000, 1, NOW()),
       ('P004', '무지 후드 티셔츠', 32000, 1, NOW()),
       ('P005', '무지 니트', 40000, 1, NOW()),
       ('P006', '무지 데님 팬츠', 45000, 2, NOW()),
       ('P007', '무지 코튼 팬츠', 35000, 2, NOW()),
       ('P008', '무지 슈프 팬츠', 37000, 2, NOW()),
       ('P009', '무지 트레이닝 팬츠', 32000, 2, NOW()),
       ('P010', '무지 후드 집업', 48000, 3, NOW());

-- ProductOption 데이터 삽입
INSERT INTO PRODUCT_OPTION (product_id, color_code, size, stock,sale_price)
VALUES (1, 101, 'S', 50,10000),
       (1, 101, 'M', 30,20000),
       (1, 101, 'L', 20,30000),
       (1, 101, 'XL', 10,40000),
       (1, 101, 'XXL', 5,50000),
       (1, 101, 'XXXL', 2,60000),
       (2, 102, 'S', 40,14000),
       (2, 102, 'M', 25,13000),
       (2, 102, 'L', 15,10000),
       (2, 102, 'XL', 8,10000),
       (2, 102, 'XXL', 4,10000),
       (2, 102, 'XXXL', 1,10000),
       (3, 103, 'S', 60,10000),
       (3, 103, 'M', 35,10000),
       (3, 103, 'L', 22,10000),
       (3, 103, 'XL', 12,10000),
       (3, 103, 'XXL', 6,10000),
       (3, 103, 'XXXL', 3,10000),
       (4, 104, 'S', 55,10000),
       (4, 104, 'M', 28,10000),
       (4, 104, 'L', 18,10000),
       (4, 104, 'XL', 9,10000),
       (4, 104, 'XXL', 2,10000),
       (4, 104, 'XXXL', 1,10000),
       (5, 105, 'S', 70,10000),
       (5, 105, 'M', 50,10000),
       (5, 105, 'L', 30,10000),
       (5, 105, 'XL', 20,10000),
       (5, 105, 'XXL', 10,10000),
       (5, 105, 'XXXL', 5,10000);


